# Pets Database

In [ ]:
import sqlite3

con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

In [4]:
# DDL
for row in cur.execute("CREATE TABLE Pet (PetID int, PetName varchar(25), OwnerName varchar(100))"):
    print(row)
con.commit()

con.close()

In [7]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("INSERT INTO Pet VALUES (1, 'Felix', 'Alex')"):
    print(row)
for row in cur.execute("INSERT INTO Pet VALUES (2, 'Auburn', 'Britt')"):
    print(row)
con.commit()

con.close()

In [8]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM Pet"):
    print(row)
con.commit()

con.close()

(1, 'Felix', 'Alex')
(2, 'Auburn', 'Britt')

In [9]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM Pet ORDER BY PetName DESC"):
    print(row)
con.commit()

con.close()

(1, 'Felix', 'Alex')
(2, 'Auburn', 'Britt')

In [11]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM Pet ORDER BY PetName"):
    print(row)
con.commit()

con.close()

(2, 'Auburn', 'Britt')
(1, 'Felix', 'Alex')

In [13]:
# DDL
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("ALTER TABLE Pet ADD COLUMN Age int"):
    print(row)
for row in cur.execute("ALTER TABLE Pet ADD COLUMN Gender varchar(1)"):
    print(row)
con.commit()

con.close()

### Update Data

In [29]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("UPDATE Pet SET Age=2, Gender='F' WHERE PetName='Auburn'"):
    print(row)
for row in cur.execute("UPDATE Pet SET Age=3, Gender='M' WHERE PetName='Felix'"):
    print(row)
con.commit()

con.close()

In [30]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM Pet"):
    print(row)
con.commit()

con.close()

(1, 'Felix', 'Alex', 3, 'M')
(2, 'Auburn', 'Britt', 2, 'F')

### Mengelompokkan Data

In [33]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("INSERT INTO Pet VALUES (3, 'Coco', 'Bill', 2, 'M')"):
    print(row)
for row in cur.execute("INSERT INTO Pet VALUES (4, 'Kin', 'Bob', 1, 'F')"):
    print(row)
con.commit()

con.close()

In [34]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT * FROM Pet ORDER BY age DESC"):
    print(row)
con.commit()

con.close()

(1, 'Felix', 'Alex', 3, 'M')
(2, 'Auburn', 'Britt', 2, 'F')
(3, 'Coco', 'Bill', 2, 'M')
(4, 'Kin', 'Bob', 1, 'F')

In [35]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT COUNT(*), gender FROM Pet GROUP BY gender"):
    print(row)
con.commit()

con.close()

(2, 'F')
(2, 'M')

### Relational Mapping

In [37]:
# DDL
con = sqlite3.connect('pets.db', timeout=10)
cur = con.cursor()

cur.execute("PRAGMA foreign_keys = 1")
sql = """CREATE TABLE PetTreatment (PetID int, TreatDate date, TreatResult varchar(255), 
CONSTRAINT fk_pet FOREIGN KEY (PetID) REFERENCES Pet(PetID))"""
cur.execute(sql)
con.commit()

con.close()

#### Menampilkan kolom yang spesifik dengan query join

In [40]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

cur.execute("INSERT INTO PetTreatment VALUES (2, '01-05-23', 'grooming done')")
cur.execute("INSERT INTO PetTreatment VALUES (1, '01-18-23', 'vaccination')")
cur.execute("INSERT INTO PetTreatment VALUES (1, '02-25-23', 'grooming done')")
con.commit()

con.close()

In [41]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

for row in cur.execute("SELECT p.PetName, p.OwnerName, t.TreatResult FROM Pet as p JOIN PetTreatment as t ON p.PetID=t.PetID"):
    print(row)
con.commit()

con.close()

('Felix', 'Alex', 'grooming done')
('Felix', 'Alex', 'vaccination')
('Auburn', 'Britt', 'grooming done')

In [50]:
# DML
con = sqlite3.connect("pets.db", timeout=10)
cur = con.cursor()

rows = cur.execute("SELECT p.PetName, p.OwnerName, t.TreatDate, t.TreatResult FROM Pet as p JOIN PetTreatment as t ON p.PetID=t.PetID")
for row in rows:
    petName = row[0]
    ownerName = row[1]
    TreatDate = row[2]
    TreatResult = row[3]
    print(f"Nama {petName} milik {ownerName} pada {TreatDate} mendapatkan {TreatResult}")
con.commit()

con.close()

Nama Felix milik Alex pada 01-18-23 mendapatkan vaccination
Nama Felix milik Alex pada 02-25-23 mendapatkan grooming done
Nama Auburn milik Britt pada 01-05-23 mendapatkan grooming done

#### Menghapus baris pada tabel

In [51]:
with sqlite3.connect('pets.db', timeout=10) as con:
    cur = con.cursor()
    cur.execute("DELETE FROM pet WHERE PetName='Coco'")
    con.commit()

In [53]:
with sqlite3.connect('pets.db', timeout=10) as con:
    cur = con.cursor()
    rows = cur.execute("SELECT * FROM Pet")
    for row in rows:
        print(row)
    con.commit()

(1, 'Felix', 'Alex', 3, 'M')
(2, 'Auburn', 'Britt', 2, 'F')
(4, 'Kin', 'Bob', 1, 'F')

### RDMS & DATAFRAMES

In [63]:
import pandas as pd
cols = ['PetID','PetName', 'OwnerName', 'Age', 'Gender', 'TreatDate', 'TreatResult']
data = []

In [64]:
with sqlite3.connect('pets.db', timeout=10) as con:
    cur = con.cursor()
    rows = cur.execute("SELECT p.PetID, p.PetName, p.OwnerName, p.Age, p.Gender, t.TreatDate, t.TreatResult FROM Pet as p JOIN PetTreatment as t ON p.PetID=t.PetID")
    for row in rows:
        data.append(row)
    con.commit()

In [65]:
df = pd.DataFrame(data, columns=cols)
df

   PetID PetName OwnerName  Age Gender TreatDate    TreatResult
0      1   Felix      Alex    3      M  01-18-23    vaccination
1      1   Felix      Alex    3      M  02-25-23  grooming done
2      2  Auburn     Britt    2      F  01-05-23  grooming done

# Musics Database

In [1]:
import sqlite3

con = sqlite3.connect("musics.db", timeout=10)
cur = con.cursor()

In [2]:
# DDL
for row in cur.execute("CREATE TABLE Music (ID int primary key, Title varchar(25), Artist varchar(100), Year int)"):
    print(row)
con.commit()

In [3]:
for row in cur.execute("INSERT INTO Music VALUES (1, 'Blinding Lights', 'The Weeknd', 2019)"):
    print(row)
for row in cur.execute("INSERT INTO Music VALUES (2, 'Shape of You', 'Ed Sheeran', 2017)"):
    print(row)
con.commit()

In [4]:
for row in cur.execute("SELECT * FROM Music"):
    print(row)
con.commit()

(1, 'Blinding Lights', 'The Weeknd', 2019)
(2, 'Shape of You', 'Ed Sheeran', 2017)

In [5]:
for row in cur.execute("SELECT * FROM Music ORDER BY Title DESC"):
    print(row)
con.commit()

(2, 'Shape of You', 'Ed Sheeran', 2017)
(1, 'Blinding Lights', 'The Weeknd', 2019)

In [6]:
for row in cur.execute("SELECT * FROM Music ORDER BY Title"):
    print(row)
con.commit()

(1, 'Blinding Lights', 'The Weeknd', 2019)
(2, 'Shape of You', 'Ed Sheeran', 2017)

In [7]:
for row in cur.execute("ALTER TABLE Music ADD COLUMN Genre varchar(25)"):
    print(row)
for row in cur.execute("ALTER TABLE Music ADD COLUMN Rating float"):
    print(row)
con.commit()

con.close()

### Update Data

In [8]:
# DML
con = sqlite3.connect("musics.db", timeout=10)
cur = con.cursor()

for row in cur.execute("UPDATE Music SET Genre='Pop', Rating=4.2 WHERE Title='Blinding Lights'"):
    print(row)
for row in cur.execute("UPDATE Music SET Genre='Pop', Rating=4.9 WHERE Title='Shape of You'"):
    print(row)
con.commit()

In [9]:
for row in cur.execute("SELECT * FROM Music"):
    print(row)
con.commit()

con.close()

(1, 'Blinding Lights', 'The Weeknd', 2019, 'Pop', 4.2)
(2, 'Shape of You', 'Ed Sheeran', 2017, 'Pop', 4.9)

### Pengelompokan Data

In [10]:
# DML
con = sqlite3.connect("musics.db", timeout=10)
cur = con.cursor()

for row in cur.execute("INSERT INTO Music VALUES (3, 'As the World Caves In', 'Matt Maltese', 2017, 'Indie', 4.9)"):
    print(row)
for row in cur.execute("INSERT INTO Music VALUES (4, 'Dandelions', 'Ruth B', 2017, 'Pop', 4.6)"):
    print(row)
con.commit()

In [11]:
for row in cur.execute("SELECT * FROM Music ORDER BY Year DESC"):
    print(row)
con.commit()

(1, 'Blinding Lights', 'The Weeknd', 2019, 'Pop', 4.2)
(2, 'Shape of You', 'Ed Sheeran', 2017, 'Pop', 4.9)
(3, 'As the World Caves In', 'Matt Maltese', 2017, 'Indie', 4.9)
(4, 'Dandelions', 'Ruth B', 2017, 'Pop', 4.6)

In [12]:
for row in cur.execute("SELECT COUNT(*), Year FROM Music GROUP BY Year"):
    print(row)
con.commit()

con.close()

(3, 2017)
(1, 2019)

### Relational Mapping

In [13]:
# DDL
con = sqlite3.connect('musics.db', timeout=10)
cur = con.cursor()

cur.execute("PRAGMA foreign_keys = 1")
sql = """CREATE TABLE Playlist (PlaylistID int, Name varchar(100), MusicID int, 
CONSTRAINT fk_music FOREIGN KEY (MusicID) REFERENCES Music(ID))"""
cur.execute(sql)
con.commit()

In [14]:
cur.execute("INSERT INTO Playlist VALUES (1, 'Chill Vibes', 1)")
cur.execute("INSERT INTO PLaylist VALUES (2, 'Indie Favorites', 3)")
cur.execute("INSERT INTO PLaylist VALUES (3, 'Chill Vibes', 4)")
con.commit()

In [15]:
for row in cur.execute("SELECT m.Title, m.Artist, p.Name FROM Music as m JOIN Playlist as p ON m.ID=p.MusicID"):
    print(row)
con.commit()

('Blinding Lights', 'The Weeknd', 'Chill Vibes')
('As the World Caves In', 'Matt Maltese', 'Indie Favorites')
('Dandelions', 'Ruth B', 'Chill Vibes')

In [16]:
rows = cur.execute("SELECT m.Title, m.Artist, m.Year, p.Name FROM Music as m JOIN Playlist as p ON m.ID=p.MusicID")
for row in rows:
    Title = row[0]
    Artist = row[1]
    Year = row[2]
    playlistName = row[3]
    print(f"Music {Title} yang dinyanyikan {Artist} dirilis pada tahun {Year} dan memasuki playlist {playlistName}")
con.commit()

con.close()

Music Blinding Lights yang dinyanyikan The Weeknd dirilis pada tahun 2019 dan memasuki playlist Chill Vibes
Music As the World Caves In yang dinyanyikan Matt Maltese dirilis pada tahun 2017 dan memasuki playlist Indie Favorites
Music Dandelions yang dinyanyikan Ruth B dirilis pada tahun 2017 dan memasuki playlist Chill Vibes

### RDMS & Dataframes

In [17]:
import pandas as pd
cols = ['Title','Artist', 'Year', 'Genre', 'Rating', 'Playlist']
data = []

In [19]:
with sqlite3.connect('musics.db', timeout=10) as con:
    cur = con.cursor()
    rows = cur.execute("SELECT m.Title, m.Artist, m.Year, m.Genre, m.Rating, p.Name FROM Music as m JOIN Playlist as p ON m.ID=p.MusicID")
    for row in rows:
        data.append(row)
    con.commit()

In [20]:
df = pd.DataFrame(data, columns=cols)
df

                   Title        Artist  Year  Genre  Rating         Playlist
0        Blinding Lights    The Weeknd  2019    Pop     4.2      Chill Vibes
1  As the World Caves In  Matt Maltese  2017  Indie     4.9  Indie Favorites
2             Dandelions        Ruth B  2017    Pop     4.6      Chill Vibes